Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བའོ། དགེ་བའི་ཆོས་ཐམས་ཅད་སྒྲུབ་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ།
en: If one were to ask why, Blessed Lord, it is because the perfection of wisdom abandons all nonvirtuous attributes and attains all virtuous attributes.” “

source: ཀཽ་ཤི་ཀ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རིག་སྔགས་ཆེན་མོའོ།
en: Kauśika, this perfection of wisdom is the great knowledge.

source: །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བླ་ན་མེད་པའི་རིག་སྔགས་སོ།
en: Kauśika, this perfection of wisdom is the unsurpassed knowledge.

source: །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་མཉམ་པ་དང་མཉམ་པའི་རིག་སྔགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Kauśika, this perfection of wisdom is the knowledge that is equal to the unequaled.

source: ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཀྱང་རིག་སྔགས་འདི་ཉིད་ལ་བརྟེན་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཏོ།
en: If you ask why, Kauśika, it is because however many tathāgatas, arhats, completely awakened buddhas of the past and the future there were and will be, and however many are alive at the present, residing in the world systems of the ten directions, relying on this same knowledge they all attained consummate buddhahood, will attain consummate buddhahood, and are attaining consummate buddhahood in unsurpassed, complete enlightenment.

source: །མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རིག་སྔགས་འདི་ཡོད་ན། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: If you ask why, Kauśika, when this knowledge is present, the paths of the ten virtuous actions will be discerned in the world.

source: བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: The four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers will be discerned in the world.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: All the perfections, all the aspects of emptiness, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas will be discerned in the world.

source: ཆོས་ཀྱི་དབྱིངས་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན། ཡང་དག་པའི་མཐའ་དང་། དེ་བཞིན་ཉིད་དང་།
en: The realm of phenomena will be discerned in the world.

source: མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: The very limit of reality, the real nature, the unmistaken real nature, the one and only real nature, reality, the abiding nature of reality, and maturity with respect to all phenomena will be discerned in the world.

source: མིག་ལྔ་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: The five eyes will be discerned in the world.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: The fruit of entering the stream to nirvāṇa will be discerned in the world.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: The fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, {Ki.

source: དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: II-III: 71} arhatship, and individual enlightenment will be discerned in the world.

source: ཐམས་ཅད་ཤེས་པ་ཉིད་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: Knowledge of all the dharmas will be discerned in the world.

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན།
en: Knowledge of the path and all-aspect omniscience will be discerned in the world. “

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་ཡོད་ན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་འཇིག་རྟེན་ན་གདགས་སུ་ཡོད་པ་ཡིན།
en: Kauśika, when bodhisattva great beings are present, the paths of the ten virtuous actions will be discerned in the world. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་འཇིག་རྟེན་ན་གདགས་སུ་ཡོད་པ་ཡིན།
en: All the other attributes, fruits, and realizations], up to and including all-aspect omniscience, will be discerned in the world.

source: རྒྱུན་དུ་ཞུགས་པ་འཇིག་རྟེན་ན་གདགས་སུ་ཡོད་པ་ཡིན།
en: Those entering the stream to nirvāṇa will be discerned in the world.

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་འཇིག་རྟེན་ན་གདགས་སུ་ཡོད་པ་ཡིན།
en: Those destined for only one more rebirth, those no longer subject to rebirth, those who are arhats, and those who are pratyekabuddhas will be discerned in the world.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་ན་གདགས་སུ་ཡོད་པ་ཡིན་ནོ། །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་དཔེར་ན། ཟླ་བའི་དཀྱིལ་འཁོར་ཡོད་ན་རྩི་དང་། རྒྱུ་སྐར་དང་། སྐར་མ་ཐམས་ཅད་གདགས་སུ་ཡོད་དོ། །ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཟླ་བའི་དཀྱིལ་འཁོར་ཡོད་ན། དགེ་བའི་སྤྱོད་པ་དང་། ཡང་དག་པའི་སྤྱོད་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Those who are tathāgatas, arhats, completely awakened buddhas will be discerned in the world. “

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་རྩི་ཐམས་ཅད་གདགས་སུ་ཡོད་དོ།
en: Kauśika, just as when the orb of the moon is present, herbs, constellations, and all the stars are discerned in the world, in the same way, Kauśika, when the orb of bodhisattvas is present, all the herbs of virtuous conduct, genuine conduct, the paths of the ten virtuous actions, all the perfections, all the aspects of emptiness, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the kinds of exact knowledge and the distinct qualities of the buddhas will be discerned.

source: །སློབ་པ་དང་། མི་སློབ་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་རྒྱུ་སྐར་དང་། སྐར་མ་ཐམས་ཅད་ཀྱང་གདགས་སུ་ཡོད་དོ།
en: All the constellations and stars of learning, no-more-learning, the śrāvakas, and the pratyekabuddhas will also be discerned.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་འཇིག་རྟེན་ན་ཡོད་པར་འགྱུར་རོ།
en: And the tathāgatas, arhats, completely awakened buddhas will also be discerned in the world. “

source: །གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཇིག་རྟེན་དུ་མ་བྱུང་བ་དེའི་ཚེ་ན་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས། སེམས་ཅན་རྣམས་ལ་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སྟོན་ཏོ།
en: Even at times when the lord buddhas do not appear in the world, bodhisattva great beings reveal the mundane and supramundane doctrines to beings.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་ཆེན་པོ་རྣམས་ཏེ།
en: If you ask why, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the Great Vehicle have originated from bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མཁས་པ་གང་དང་ལྡན་པས། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྤྱོད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: Bodhisattva great beings who are skilled in means practice the six perfections; practice all the aspects of emptiness; practice the thirty-seven factors conducive to enlightenment; practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, and the three gateways to liberation; {Ki.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་སྤྱོད་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: II-III: 72} and they practice the six extrasensory powers, the ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པ་དང་། ཉན་ཐོས་ཀྱི་སར་མི་ལྟུང་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ས་མངོན་དུ་མི་བྱེད་པ་དང་།
en: They do not lapse into the level of the śrāvakas and they do not actualize the level of the pratyekabuddhas.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད་པ་དང་།
en: They bring beings to maturation and they refine the buddhafields.

source: ཚེ་ཕུན་སུམ་ཚོགས་པ་ཡང་ཡོངས་སུ་འཛིན་པ་དང་། སེམས་ཅན་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་ཐོབ་པར་བྱེད་པའི་ཐབས་མཁས་པ་དེ་ཡང་།
en: They also bring about the perfect fulfillment of long life, they bring about the perfect fulfillment of beings, they bring about the perfect fulfillment of the buddhafields, they bring about the perfect fulfillment of the bodhisattvas, and they attain all-aspect omniscience.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བར་རིག་པར་བྱའོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་།
en: One should know that this skill in means has originated from the perfection of wisdom. “

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ནི་ཚེ་འདིའི་ཡོན་ཏན་འདི་དག་དང་། ཚེ་རབས་གཞན་གྱི་ཡོན་ཏན་འདི་དག་དང་ཡང་ལྡན་པར་འགྱུར་རོ། །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་།
en: Moreover, Kauśika, noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom will possess these attributes that pertain to the present life and those that pertain to other lives.”

source: ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་ཚེ་འདིའི་ཡོན་ཏན་གང་དང་ལྡན་པར་འགྱུར་བ་ལགས། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་།
en: Śakra then asked, “Blessed Lord, what are the attributes pertaining to the present life that will be possessed by noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom?” “

source: ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མ་གཏོགས་པར། དུག་གིས་དུས་བྱེད་པར་མི་འགྱུར་རོ། །མཚོན་གྱིས་དུས་བྱེད་པར་མི་འགྱུར་རོ།
en: Kauśika,” replied the Blessed One, “the noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, other than dying due to the maturation of past actions, will not die due to poisoning, they will not die due to weapons, they will not die due to fire, and they will not die due to water.

source: །མེས་དུས་བྱེད་པར་མི་འགྱུར་རོ། །ཆུས་དུས་བྱེད་པར་མི་འགྱུར་རོ། །ནད་བརྒྱ་རྩ་གཅིག་གི་བར་གྱིས་དུས་བྱེད་པར་མི་འགྱུར་རོ།
en: They will not die due to other causes, up to and including the one hundred and one diseases.

source: །རྒྱལ་པོ་དང་བླ་མས་གནོད་པར་བྱ་བ་ཞིག་བྱུང་བ་ལས། གལ་ཏེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཁ་ཏོན་དུ་བྱེད་ཅིང་། རྒྱལ་པོའི་ཕོ་བྲང་དུ་སོང་ན། དེ་ལ་གླགས་ཚོལ་བ་དེ་དག་གིས་གླགས་མི་རྙེད་དེ།
en: In contrast to the afflictions that might be imposed upon them by kings and superiors, if the noble sons or noble daughters go to the royal palace, chanting this perfection of wisdom, those who seek to inflict harm upon them will have no opportunity to do so.

source: རྒྱལ་པོའི་བུ་དང་། རྒྱལ་པོའི་བློན་པོ་ཆེན་པོ་དག་ཀྱང་གཏམ་དྲི་བ་དང་། གཏམ་བྱ་བར་སེམས་ཤིང་། དགའ་བར་བྱ་བར་སེམས་པར་འགྱུར་རོ།
en: Even the king’s son and the king’s chief minister will greet them, thinking they should be greeted and thinking they should be pleased.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ཀྱི་གཟི་བརྗིད་དང་མཐུས་དེ་ལྟར་སེམས་སོ། །གལ་ཏེ་རིགས་ཀྱི་བུའམ།
en: If you ask why, it is because they think in that manner through the brilliance and power of this very perfection of wisdom.

source: རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ཁ་ཏོན་དུ་བྱེད་ཅིང་། རྒྱལ་པོའི་ཕོ་བྲང་དུ་སོང་ན། དེ་ལ་རྒྱལ་པོའི་བུའམ་རྒྱལ་པོའི་བློན་པོ་ཆེན་པོ་དག་ཀྱང་དགའ་བའི་ཚིག་གིས་གཏམ་དྲི་བ་དང་། གཏམ་བྱ་བར་སེམས་ཤིང་དགའ་བར་བྱ་བར་སེམས་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If any noble sons or noble daughters should go to the royal palace, chanting this same perfection of wisdom, even the king’s son or the king’s chief minister would greet them with pleasing words, thinking they should be greeted, and thinking they should be pleased.

source: ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་ཉེ་བར་གཞག །སྙིང་རྗེའི་སེམས་དང་། དགའ་བའི་སེམས་དང་། བཏང་སྙོམས་ཀྱི་སེམས་ཉེ་བར་གཞག་པའི་ཕྱིར་ཏེ།
en: If you ask why, Kauśika, it is because those noble sons or noble daughters have established thoughts of loving kindness toward all beings, and they have established thoughts of compassion, empathetic joy, and equanimity toward them.

source: ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་།
en: Kauśika, any noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom will possess those attributes pertaining to this life. {

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ནི། ཚེ་འདིའི་ཡོན་ཏན་དེ་དག་དང་ལྡན་པར་འགྱུར་རོ།
en: Ki.

source: །ཀཽ་ཤི་ཀ་ཚེ་རབས་གཞན་གྱི་ཡོན་ཏན་གང་དག་དང་ཡང་ལྡན་པར་འགྱུར་ཞེ་ན། འདི་ལྟ་སྟེ་ནམ་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་བྲལ་བར་མི་འགྱུར་ཏེ། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་བྲལ་བར་མི་འགྱུར་རོ།
en: II-III: 73} “Kauśika, if you ask what are the attributes they will possess pertaining to other lives, they are as follows: They will never be separated from the paths of the ten virtuous actions, and they will never be separated from the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the six perfections, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the three gateways to liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the distinct qualities of the buddhas.

source: །དེ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྨོན་ལམ་གྱི་དབང་མ་གཏོགས་པར། ནམ་ཡང་སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་མི་སྐྱེའོ། །དེ་ནམ་ཡང་ཡན་ལག་ཉམས་པ་ཅན་དུ་མི་འགྱུར།
en: Except through the power of their aspiration to bring beings to maturity, they will never [involuntarily] be reborn in the hells, in the animal realm, or in the world of Yama, and they will never be born crippled.

source: ནམ་ཡང་དབུལ་པོའི་རིགས་སུ་མི་སྐྱེ། སྨྱིག་མ་མཁན་གྱི་རིགས་སམ། སྨེ་ཤ་ཅན་གྱི་རིགས་སམ། མགར་བའམ། ཕྱག་དར་བའམ།
en: They will never be born in an impoverished family, and they will never be reborn in the caste of reed-makers; the castes of garbage collectors, blacksmiths, sweepers, butchers, or pig slayers; or other castes of inferior class.

source: ཤེན་པའམ། ཕག་གསོད་པའི་རིགས་སམ། དམངས་རིགས་སུ་མི་སྐྱེ་སྟེ། རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པར་འགྱུར།
en: They will always and without interruption be reborn with the thirty-two major marks of a great person.

source: འཇིག་རྟེན་གྱི་ཁམས་གང་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་རྫུས་ཤིང་སྐྱེ་བར་འགྱུར་ཏེ།
en: They will be reborn miraculously in those world systems where the lord buddhas are alive and residing at present.

source: ནམ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་དང་བྲལ་བར་མི་འགྱུར་རོ།
en: They will never be separated from the extrasensory powers of the bodhisattvas.

source: །དེ་འདོད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་ཏེ།
en: At will they may travel from buddhafield to buddhafield in order to see the lord buddhas, pay homage to them, venerate them, and listen to their Dharmas.

source: དེ་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་ཞིང་། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །ཀཽ་ཤི་ཀ་དེ་བས་ན་རིགས་ཀྱི་བུའམ།
en: Journeying from buddhafield to buddhafield, they will bring beings to maturity and they will even refine the buddhafields. “

source: རིགས་ཀྱི་བུ་མོ་ཡོན་ཏན་འདི་དག་ཕུན་སུམ་ཚོགས་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཟུང་བར་བྱ། བཅང་བར་བྱ། ཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ།
en: Kauśika, so it is that those noble sons or noble daughters who excellently seek these attributes should take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom.

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བར་བྱའོ།
en: They should not be separated from the mind set on all-aspect omniscience.

source: །དེ་དག་ནི་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཚེ་འདིའི་ཡོན་ཏན་དང་། ཚེ་རབས་གཞན་གྱི་ཡོན་ཏན་དེ་དག་དང་ལྡན་པར་འགྱུར་རོ།
en: Until they attain consummate buddhahood in unsurpassed, complete enlightenment, they will possess those attributes pertaining to this life and those attributes pertaining to other lives.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཅུ་དགུ་པའོ།། །།
en: This completes the nineteenth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་མུ་སྟེགས་ཅན་གཞན་དང་། ཀུན་དུ་རྒྱུ་བ་གླགས་པ་བལྟ་བའི་བསམ་པ་ཅན་བརྒྱ་ཙམ་ཞིག །བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་དོང་བ་དང་། དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། མུ་སྟེགས་ཅན་གཞན་དང་།
en: Chapter 20 Then a hundred or so rival tīrthikas and wandering mendicants approached with harmful intent the place where the Blessed One was, and Śakra, mighty lord of the gods, had the following thought: “These rival tīrthikas and wandering mendicants have approached with harmful intent the place where the Blessed One is.

source: ཀུན་དུ་རྒྱུ་བ་བརྒྱ་པོ་གླགས་བལྟ་བའི་བསམ་པ་ཅན་འདི་དག་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་ནས་དེ་ལ་བདག་གིས་ཅི་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བརྗོད་པས། མུ་སྟེགས་ཅན་གཞན་དང་། ཀུན་དུ་རྒྱུ་བ་འདི་དག་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་དོང་ནས།
en: I should by whatever means speak to them of the perfection of wisdom, so that once those rival tīrthikas and wandering mendicants have approached the Blessed One, no obstacle will arise.

source: བར་ཆད་བྱེད་པར་མི་འགྱུར་བར་བདག་གིས་བཅོམ་ལྡན་འདས་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཇི་སྙེད་ཅིག་བཟུང་བ་དེ་དག་ཁ་ཏོན་དུ་བྱའོ་སྙམ་ནས།
en: To that end I should chant all that I have grasped of this perfection of wisdom from the Blessed One.” {Ki.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཇི་སྙེད་བཟུང་བ་དེ་དག་ཁ་ཏོན་དུ་བརྗོད་དོ།
en: II-III: 74} Then Śakra, mighty lord of the gods, chanted as much of the perfection of wisdom as he had grasped from the Blessed One.

source: །དེ་ནས་མུ་སྟེགས་ཅན་གཞན་དང་། ཀུན་དུ་རྒྱུ་བ་དེ་དག་རྒྱང་རིང་པོ་རིང་པོ་ནས། བཅོམ་ལྡན་འདས་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ལམ་དེ་ཉིད་དང་སྒོ་དེ་ཉིད་ནས་ཕྱིར་དོང་ངོ་། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ།
en: Thereupon, those rival tīrthikas and wandering mendicants circumambulated the Blessed One from afar, in a clockwise direction, and then departed by the same path and the same door.

source: དེ་ལྟར་མུ་སྟེགས་ཅན་གཞན་དང་། ཀུན་དུ་རྒྱུ་བ་དེ་དག་གིས། རྒྱང་རིང་པོ་ནས་བཅོམ་ལྡན་འདས་ལ་གཡས་ཕྱོགས་ནས་བསྐོར་བ་བྱས་ཏེ། ལམ་དེ་ཉིད་དང་སྒོ་དེ་ཉིད་ནས་ཕྱིར་དོང་ན། དེ་ཅིའི་རྒྱུ་ཞིག་སྙམ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུའི་སེམས་ཀྱི་ཀུན་དུ་རྟོག་པ་ཐུགས་ཀྱིས་ཐུགས་སུ་ཆུད་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: Then the venerable Śāradvatīputra thought, “What is the reason for those rival tīrthikas and wandering mendicants circumambulating the Blessed One from afar, in a clockwise direction, and then departing by that very path and by that very door?”

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དག་པར་བསམས་པས། དེའི་ཕྱིར་མུ་སྟེགས་ཅན་གཞན་དང་། ཀུན་དུ་རྒྱུ་བ་འདི་དག་རྒྱང་རིང་པོ་རིང་པོ་ནས་ང་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ལམ་དེ་ཉིད་དང་སྒོ་དེ་ཉིད་ནས་ཕྱིར་དོང་བ་ཡིན་ནོ།
en: Knowing in his mind the thoughts in the mind of the venerable Śāradvatīputra, the Blessed One addressed the venerable Śāradvatīputra as follows: “Śāradvatīputra, Śakra, mighty lord of the gods, has genuinely brought to mind the perfection of wisdom, and for that reason, those rival tīrthikas and wandering mendicants circumambulated me from afar, in a clockwise direction, and then departed by that very path and by that very door.

source: །ཤ་ར་དྭ་ཏིའི་བུ་མུ་སྟེགས་ཅན་གཞན་དང་། ཀུན་དུ་རྒྱུ་བ་འདི་དག་ལས་འགའ་ཙམ་ཡང་དཀར་པོའི་སེམས་དང་ལྡན་པར་མ་མཐོང་སྟེ།
en: Śāradvatīputra, among those rival tīrthikas and wandering mendicants I do not see any with a positive attitude.

source: མུ་སྟེགས་ཅན་གཞན་དང་། ཀུན་དུ་རྒྱུ་བ་འདི་དག་ཐམས་ཅད་ནི་གནོད་པར་བྱ་བའི་སེམས་དང་ལྡན་པ། གླགས་བལྟ་བའི་བསམ་པ་ཅན་ཤ་སྟག་སྟེ།
en: All these rival tīrthikas and wandering mendicants have malicious thoughts and without exception all have intentions that seek to intrude [and cause harm].
